Revit 2027 API
RebarShape.GetMultiplanarDefinition Method
 The optional 3D structure of the shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeMultiplanarDefinition GetMultiplanarDefinition()
Public Function GetMultiplanarDefinition As RebarShapeMultiplanarDefinition
public:
RebarShapeMultiplanarDefinition^ GetMultiplanarDefinition()
member GetMultiplanarDefinition : unit -> RebarShapeMultiplanarDefinition
Return Value
RebarShapeMultiplanarDefinition
 A copy of the multiplanar definition. Changes will not affect the RebarShape.
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace